#include <stdio.h>

//int main() {
//    float f1 = 10.0;//4.0
//    int a1 = 10;//4
//    double f2 = 10.00;
//    return 0;
//}




//int main(){
//    /*
//     * 整形家族
//     * char
//     *      unsigned char 0~255
//     *      signed char -128~127
//     * short
//     *      unsigned short [int]
//     *      signed short [int]
//     * int
//     *      unsigned int [int]
//     *      signed int [int]
//     * long
//     *      unsigned long [int]
//     *      signed long [int]
//     * 浮点形家族
//     *      float
//     *      doube
//     * 构造类型
//     *      数组类型--int arr[10]; int[10] int[5] char [5]
//     *      结构体类型--struct
//     *      枚举类型--enum
//     *      联合类型--union
//     * 指针类型
//     *      int *pi;
//     *      int *pc;
//     *      int *pf;
//     *      int * pv;
//     * 空类型
//     *      void表示空类型（无类型）
//     *      通常用于函数的返回类型，函数的参数，指针类
//     * 源码，反码，补码：计算机中整形有符号数有三种表示方法，
//     */
//    int a = 20;
//    //00000000 00000000 00000000 00010100--源码
//    //00000000 00000000 00000000 00010100--反码
//    //00000000 00000000 00000000 00010100--补码
//    //四个二进制位转换为一个十六进制位
//    //00000014
//    int b = -10;
//    //00000000 00000000 00000000 00001010--源码
//    //11111111 11111111 11111111 11110101--反码
//    //11111111 11111111 11111111 11110110--补码
//    //FFFFFFF6
//    printf("%d\n", 1%3);
//    return 0;
//}





////数据在内存中存储的是补码
//int main(){
//    1-1;
//    1+(-1);
//    //00000000 00000000 00000000 00000001
//    //11111111 11111111 11111111 11111111
//    //10000000 00000000 00000000 00000000
//
//    //10000000 00000000 00000000 00000001
//    //11111111 11111111 11111111 11111110
//    //11111111 11111111 11111111 11111111
//
//    //00000000 00000000 00000000 00000001--源码：1
//    //10000000 00000000 00000000 00000001--源码：-1
//    //10000000 00000000 00000000 00000010--二进制相加出现问题
//    return 0;
//}






//int check_sys(){
//    int a = 1;
////    char *p = (char *)&a;
////    return *p;
//    return *(char *)&a;
//}
////指针类型的意义
////1.指针类型决定了指针解引用操作可以访问几个字节：char *p：*p可以访问1个字节；int *p：*p可以访问4个字节
////2.指针类型决定了+1，-1。加的或捡的是几个字节：char *p，p+1：可以跳过1字节；int *p，p+1：可以跳过一个整形，4字节
//int main() {
////    int a = 20;
//    //0000 0000 0000 0000 0000 0001 0100
//    //0x00 00 00 14
//    /*14 00 00 00
//     * 大端（存储）模式：是指数据的低位保存在呢存的高地址中，而数据的高位，保存在内存的低地址中；
//     * 小端（存储）模式：是指数据的低位保存在内存的低地址中，而数据的高位，保存在内存的高低之中；
//     */
//    /*写一段代码：判断机器当前字节序是什么
//     * int a = 20;
//     * 低地址➡--️14 00 00 00--➡高地址【小端】
//     * 低地址➡--00 00 00 14--➡高地址【大端】
//     */
//    int a = 1;
//    //0x000001
////    char *p = (char *) &a;
////    if (*p == 1){
////        printf("小端\n");
////    }else{
////        printf("大端\n");
////    }
//    //返回1，小端
//    //返回0，大端
//    int ret = check_sys();
//    if (ret == 1){
//        printf("小端\n");
//    }else{
//        printf("大端\n");
//    }
//    return 0;
//}







//int main(){
//    int a = 0x11223344;
//    int *p = &a;
//    *p = 0;
//    char *p = &a;
//    return 0;
//}







//int main(){
//    char a = -1;
//    //10000000 0000000 0000000 0000001
//    //11111111 1111111 1111111 1111110
//    //11111111 1111111 1111111 1111111
//    //
//    signed char b = -1;
//    //1111111
//    unsigned char c = -1;
//    //00000000 00000000 00000000 1111111
//    printf("a=%d,b=%d,c=%d\n",a,b,c);
//    return 0;
//}







//int main(){
//    char a = -128;
//    printf("%u\n", a);
//    //10000000 00000000 00000000 10000000
//    //11111111 11111111 11111111 01111111
//    //11111111 11111111 11111111 10000000--补码
//    //10000000
//    //11111111 11111111 11111111 10000000--补码
//    //%d：十进制有符号数字
//    //%u：十进制无符号数字
//    int i = -20;
//    //10000000 00000000 00000000 00010100
//    //11111111 11111111 11111111 11101011
//    //11111111 11111111 11111111 11101100--[-20补码]
//    int j = 10;
//    //10000000 00000000 00000000 00001010--[10补码]
//    //11111111 11111111 11111111 11101100--[-20补码]
//    //11111111 11111111 11111111 11110110--[相加的结果]
//    //11111111 11111111 11111111 11110101--【-1得反码】
//    //10000000 00000000 00000000 00001010--【取反得源码】
//    printf("%d\n", i+j);
//    return 0;
//}





//int main(){
//    unsigned int i;
//    //00000000 00000000 00000000 00001001
//    for (i = 9; i >= 0; --i) {
//        printf("%u\n", i);
//    }
//    return 0;
//}







//#include <string.h>
//int main(){
//    char a[1000];
//    char b[10];
//    int i;
//    for (i = 1; i < 1000; ++i) {
//        a[i] = -1-i;
//    }
//    printf("a=%d ", strlen(a));
//    printf("b=%d ", strlen(b));
//    return 0;
//}




//unsigned char i = 0;//0~255
//int main(){
//    for (i = 0; i <= 255; ++i) {
//        printf("hello world\n");
//    }
//    return 0;
//}




//int main(){
//    double d = 1E10;
//    printf("%lf\n",d);
//    return 0;
//}




int main(){
    int n = 9;
    float *pFloat = (float *)&n;
    printf("n=%d\n", n);
    printf("pFloat=%d\n",pFloat);
    *pFloat = 9.0;
    printf("n=%d\n", n);
    printf("pFloat=%d\n", pFloat);
    return 0;
}